src/main/java/ok/dht/test/slastin/wrk2/data/get-5000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2105.388ms, rate sampling interval: 6914ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.34s     5.87s   23.27s    59.09%
    Req/Sec     3.04k   174.63     3.33k    57.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.18s 
 75.000%   18.19s 
 90.000%   21.66s 
 99.000%   23.13s 
 99.900%   23.27s 
 99.990%   23.27s 
 99.999%   23.28s 
100.000%   23.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3764.223     0.000000            2         1.00
    5308.415     0.100000        15252         1.11
    7544.831     0.200000        30494         1.25
    9093.119     0.300000        45798         1.43
   11075.583     0.400000        61000         1.67
   13180.927     0.500000        76230         2.00
   14172.159     0.550000        83891         2.22
   15523.839     0.600000        91483         2.50
   16334.847     0.650000        99125         2.86
   17334.271     0.700000       106768         3.33
   18186.239     0.750000       114454         4.00
   18612.223     0.775000       118221         4.44
   20054.015     0.800000       122092         5.00
   20414.463     0.825000       125782         5.71
   20807.679     0.850000       129613         6.67
   21200.895     0.875000       133404         8.00
   21446.655     0.887500       135391         8.89
   21659.647     0.900000       137220        10.00
   21889.023     0.912500       139213        11.43
   22102.015     0.925000       141073        13.33
   22315.007     0.937500       143047        16.00
   22413.311     0.943750       143986        17.78
   22511.615     0.950000       144934        20.00
   22626.303     0.956250       145889        22.86
   22724.607     0.962500       146829        26.67
   22822.911     0.968750       147786        32.00
   22872.063     0.971875       148280        35.56
   22921.215     0.975000       148747        40.00
   22970.367     0.978125       149258        45.71
   23019.519     0.981250       149700        53.33
   23052.287     0.984375       150083        64.00
   23085.055     0.985938       150477        71.11
   23101.439     0.987500       150674        80.00
   23117.823     0.989062       150850        91.43
   23134.207     0.990625       151027       106.67
   23166.975     0.992188       151338       128.00
   23183.359     0.992969       151515       142.22
   23183.359     0.993750       151515       160.00
   23199.743     0.994531       151702       182.86
   23216.127     0.995313       151877       213.33
   23216.127     0.996094       151877       256.00
   23232.511     0.996484       152077       284.44
   23232.511     0.996875       152077       320.00
   23232.511     0.997266       152077       365.71
   23248.895     0.997656       152259       426.67
   23248.895     0.998047       152259       512.00
   23248.895     0.998242       152259       568.89
   23248.895     0.998437       152259       640.00
   23248.895     0.998633       152259       731.43
   23265.279     0.998828       152439       853.33
   23265.279     0.999023       152439      1024.00
   23265.279     0.999121       152439      1137.78
   23265.279     0.999219       152439      1280.00
   23265.279     0.999316       152439      1462.86
   23265.279     0.999414       152439      1706.67
   23265.279     0.999512       152439      2048.00
   23265.279     0.999561       152439      2275.56
   23265.279     0.999609       152439      2560.00
   23265.279     0.999658       152439      2925.71
   23265.279     0.999707       152439      3413.33
   23265.279     0.999756       152439      4096.00
   23265.279     0.999780       152439      4551.11
   23265.279     0.999805       152439      5120.00
   23265.279     0.999829       152439      5851.43
   23265.279     0.999854       152439      6826.67
   23265.279     0.999878       152439      8192.00
   23265.279     0.999890       152439      9102.22
   23281.663     0.999902       152454     10240.00
   23281.663     1.000000       152454          inf
#[Mean    =    13336.354, StdDeviation   =     5872.463]
#[Max     =    23265.280, Total count    =       152454]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  183664 requests in 1.00m, 37.43MB read
Requests/sec:   3061.09
Transfer/sec:    638.75KB