src/main/java/ok/dht/test/slastin/wrk2/data/puts-10000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.753ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms    1.21ms  24.64ms   96.41%
    Req/Sec    10.55k     1.19k   24.44k    77.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    1.32ms
 90.000%    1.92ms
 99.000%    6.17ms
 99.900%   14.71ms
 99.990%   22.32ms
 99.999%   24.43ms
100.000%   24.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000            7         1.00
       0.221     0.100000        50112         1.11
       0.388     0.200000       100101         1.25
       0.552     0.300000       150045         1.43
       0.713     0.400000       200052         1.67
       0.869     0.500000       249980         2.00
       0.945     0.550000       275115         2.22
       1.016     0.600000       300289         2.50
       1.075     0.650000       325267         2.86
       1.150     0.700000       350123         3.33
       1.319     0.750000       375076         4.00
       1.412     0.775000       387477         4.44
       1.510     0.800000       400000         5.00
       1.609     0.825000       412465         5.71
       1.712     0.850000       425023         6.67
       1.817     0.875000       437494         8.00
       1.870     0.887500       443710         8.89
       1.924     0.900000       450009        10.00
       1.975     0.912500       456260        11.43
       2.023     0.925000       462530        13.33
       2.069     0.937500       468838        16.00
       2.093     0.943750       471938        17.78
       2.125     0.950000       475017        20.00
       2.175     0.956250       478085        22.86
       2.251     0.962500       481264        26.67
       2.351     0.968750       484375        32.00
       2.415     0.971875       485926        35.56
       2.511     0.975000       487455        40.00
       2.853     0.978125       489014        45.71
       3.427     0.981250       490578        53.33
       4.359     0.984375       492144        64.00
       4.903     0.985938       492921        71.11
       5.371     0.987500       493700        80.00
       5.803     0.989062       494481        91.43
       6.467     0.990625       495262       106.67
       7.283     0.992188       496044       128.00
       7.735     0.992969       496439       142.22
       8.343     0.993750       496825       160.00
       9.023     0.994531       497219       182.86
       9.967     0.995313       497608       213.33
      11.087     0.996094       497998       256.00
      11.495     0.996484       498192       284.44
      11.847     0.996875       498386       320.00
      12.239     0.997266       498582       365.71
      12.607     0.997656       498778       426.67
      12.967     0.998047       498975       512.00
      13.207     0.998242       499071       568.89
      13.495     0.998437       499168       640.00
      13.927     0.998633       499266       731.43
      14.367     0.998828       499363       853.33
      14.751     0.999023       499461      1024.00
      14.927     0.999121       499509      1137.78
      15.311     0.999219       499558      1280.00
      15.671     0.999316       499607      1462.86
      16.119     0.999414       499656      1706.67
      16.527     0.999512       499705      2048.00
      16.639     0.999561       499732      2275.56
      17.359     0.999609       499753      2560.00
      18.095     0.999658       499778      2925.71
      18.351     0.999707       499802      3413.33
      18.895     0.999756       499826      4096.00
      19.247     0.999780       499839      4551.11
      19.935     0.999805       499851      5120.00
      20.575     0.999829       499863      5851.43
      21.167     0.999854       499875      6826.67
      21.791     0.999878       499887      8192.00
      22.127     0.999890       499894      9102.22
      22.367     0.999902       499900     10240.00
      22.703     0.999915       499906     11702.86
      22.975     0.999927       499912     13653.33
      23.263     0.999939       499918     16384.00
      23.423     0.999945       499921     18204.44
      23.567     0.999951       499924     20480.00
      23.711     0.999957       499927     23405.71
      23.855     0.999963       499930     27306.67
      24.015     0.999969       499933     32768.00
      24.111     0.999973       499935     36408.89
      24.143     0.999976       499937     40960.00
      24.191     0.999979       499938     46811.43
      24.239     0.999982       499939     54613.33
      24.351     0.999985       499941     65536.00
      24.383     0.999986       499942     72817.78
      24.383     0.999988       499942     81920.00
      24.431     0.999989       499943     93622.86
      24.479     0.999991       499944    109226.67
      24.527     0.999992       499945    131072.00
      24.527     0.999993       499945    145635.56
      24.527     0.999994       499945    163840.00
      24.575     0.999995       499946    187245.71
      24.575     0.999995       499946    218453.33
      24.639     0.999996       499947    262144.00
      24.639     0.999997       499947    291271.11
      24.639     0.999997       499947    327680.00
      24.639     0.999997       499947    374491.43
      24.639     0.999998       499947    436906.67
      24.655     0.999998       499948    524288.00
      24.655     1.000000       499948          inf
#[Mean    =        1.060, StdDeviation   =        1.212]
#[Max     =       24.640, Total count    =       499948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599989 requests in 1.00m, 38.34MB read
Requests/sec:   9999.82
Transfer/sec:    654.29KB